pemfcSinglePhaseModel-4.0/run/constant/air/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.001/air/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    airInlet
    {
        type            patch;
        nFaces          840;
        startFace       111448;
    }
    airOutlet
    {
        type            patch;
        nFaces          840;
        startFace       112288;
    }
    cgdlSides
    {
        type            patch;
        nFaces          2640;
        startFace       113128;
    }
    cclSides
    {
        type            patch;
        nFaces          264;
        startFace       115768;
    }
    air_to_cbp
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          10208;
        startFace       116032;
        sampleMode      nearestPatchFace;
        sampleRegion    cbp;
        samplePatch     cbp_to_air;
    }
    air_to_electrolyte
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          968;
        startFace       126240;
        sampleMode      nearestPatchFace;
        sampleRegion    electrolyte;
        samplePatch     electrolyte_to_air;
    }
)

// ************************************************************************* //
