pemfcSinglePhaseModel-4.0/run/constant/abp/abpProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "constant/abp";
    object          abpProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho     [1 -3 0 0 0 0 0]     1880.0;
Cp              Cp      [0 2 -2 -1 0 0 0]     875.0;
k               k       [1 1 -3 -1 0 0 0]      10.7;

// ************************************************************************* //
