pemfcSinglePhaseModel-4.0/run/0/air/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 353.0; // 79.85degC

boundaryField
{

    airInlet
    {
        type            fixedValue;
        value           $internalField;
    }

    airOutlet
    {
        type            zeroGradient;
    }

    airSides
    {
        type            zeroGradient;
    }

    cgdlSides
    {
        type            zeroGradient;
    }

    cclSides
    {
        type            zeroGradient;
    }

    air_to_electrolyte //cathode
    {
        type            zeroGradient;
    }

    air_to_cbp
    {
        type            zeroGradient;
    }      
}

// ************************************************************************* //
