pemfcSinglePhaseModel-4.0/run/0/fuel/YCO2fuel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fuel";
    object      YC02fuel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuelInlet
    {
        type            fixedValue;
        value           $internalField;
    }

    fuelOutlet
    {
        type            zeroGradient;
    }

    fuelSides
    {
        type            zeroGradient;
    }
    
    agdlSides
    {
        type            zeroGradient;
    }
    
    aclSides
    {
        type            zeroGradient;
    }
    
    fuel_to_electrolyte //anode
    {
        type            fixedGradient;
        gradient        uniform 0;
    }

    fuel_to_abp
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
