pemfcSinglePhaseModel-4.0/run/0/fuel/diffH2fuel
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fuel";
    object      diffCH3OHfuel;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuelInlet
    {
        type          fixedValue;
        value         uniform 1.0e-15;    //disallow outward diffusion at inlet
                                        // value 0 causes harmonic averaging FPE
    }

    fuelOutlet
    {
        type          zeroGradient;
    }

    fuelSides
    {
        type          zeroGradient;
    }

    agdlSides
    {
        type          zeroGradient;
    }

    aclSides
    {
        type          zeroGradient;
    }

    fuel_to_electrolyte
    {
        type          zeroGradient;
    }

    fuel_to_abp
    {
        type          zeroGradient;
    }
}

// ************************************************************************* //
